## 型
### 型の確認
```py
print(True, type(is_ok)) # (True, <type 'bool'>)
```

### 型の変換
```py
new_num = int('1')
print(new_num, type(new_num))
```
型の宣言をしても固定されるわけではない。

### 変数宣言
```py
1num = 1 # SyntaxError: invalid syntax
if = 1 # SyntaxError: invalid syntax
```
- 変数の命名の頭文字に数字は使えない。
- pythonが予約している言葉は使えない。


## print関数
python2系だとprintの挙動が違うので注意。

### sep
セパレーションする文字を指定。

### end
最後にはいる文字を指定。デフォルトでは`\n`


## 数値

### 浮動小数型
```py
> type(1.6) # <class 'float'>
```

### 割り算で小数点を省略したい
```py
> 17 / 3 (5.666666666666667) # 近似値まで表示
> 17 // 3 (5.3)
```

### べき乗
```py
> 5 ** 5 # 3125
```

### round関数
```py
> round( 3.1415555, 2) # 3.14
```

### 数学関数
```py
import math
x = math.sqrt(25)
print(x) # 5.0 (平方根)

y = math.log2(10)
print(y) # 3.321928094887362 （ログ）

print(help(math)) # ヘルプ関数の表示
```


## 文字列

### リテラル
コーテーションで囲んだ文字列のこと

### raw関数
パスなどをそのまま出力することができる。
```py
print(r'C:\dir\file') # C:\dir\file
```

### 改行を有効化
ダブルコーテーションを3つ。`\`を入れると空白行を消してくれる。
```py
print("""\
line1
line2
line3\
""")
# line1
# line2
# line3
```

### 演算子を使って文字列を表示する
```py
print('Hi.' * 3 + 'Mike') # Hi.Hi.Hi.Mike
```

### インデックス文字列とスライス
```py
word = 'python'
print(word[0]) # p
print(word[-1]) # n
print(word[1:3]) # yt
print(word[:3]) # pyt # 最初から3文字目まで
print(word[2:]) # thon # 2文字目から最後まで
print(word[:]) # 最初から最後まで
word = 'j' + word[1:]
print(word) # jython
```

### len関数
```py
word = 'python'
n = len(word)
print(n)
```

### 文字列にまつわる関数
```py
s = 'My name is Mike. Hi Mike.'

# 最初の文字列を確認する
is_start = s.startswith('My')
print(is_start) # True
is_start = s.startswith('X')
print(is_start) # False

# 文字列を探す。rfindは最後から探す。
print(s.find('Mike'))
print(s.rfind('Mike'))
# 何度でてきたか測定する。
print(s.count('Mike'))
# 最初は大文字ほかは小文字
print(s.capitalize()) # My name is mike. hi mike.
# 単語の頭文字を大文字に
print(s.title()) # My Name Is Mike. Hi Mike.
# 指定した文字列を変換する
print(s.replace('Mike', 'Nancy')) # My name is Nancy. Hi Nancy.
```

### 文字の代入
```py
> 'a is {}'.format('test')
# 'a is test'

> 'a is {} {} {}'.format(1, 2, 3)
# 'a is 1 2 3'

> 'My name is {name} {family}. Watashi ha {family} {name}.'.format(name = 'Ryo', family = 'Sakai')
# 'My name is Ryo Sakai. Watashi ha Sakai Ryo.'
```

#### f-string
Python 3.6よりformatではなく、f-stringsが以下のように使える。  
新しいスタイルになり処理も早い。
```py
a = 'a'
print(f'a is {a}')
 
x, y, z = 1, 2, 3
print(f'a is {x}, {y}, {z}')
print(f'a is {z}, {y}, {x}')
 
name = 'Jun'
family = 'Sakai'
print(f'My name is {name} {family}. Watashi ha {family} {name}')
```