# データ構造

## リスト型
```py
> l = [1, 2, 29, 19]
> l[2:] # [29, 19]
> type(l) #<class 'list'>
> len(l) # 4
> l[100] # IndexError: list index out of range
> a = [1,2,3]
> n = ['a','b','c']
> x = [a, n] # [[1, 2, 3], ['a', 'b', 'c']]
> x[0][1] # 2
> list('abcde') # ['a', 'b', 'c', 'd', 'e']
```

## リストの操作
```py
> s = list('abcde') # ['a', 'b', 'c', 'd', 'e']
> s[0] = 'X' # ['X', 'b', 'c', 'd', 'e']
> s[2:5] = [] # ['X', 'b']
> s[:] = [] # []
```
- 空の配列に再定義すると、削除することができる。

``` py
> n = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
> n.append(100) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
> n.insert(0, 100) # [100, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
> n.pop(0) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
100 # 100が変えてくる
> del n[0] # [2, 3, 4, 5, 6, 7, 8, 9, 10, 100]
> del n # n自体が消える。
> n
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
NameError: name 'n' is not defined
```
- `append(value)` 配列の最後に値を追加
- `insert(n, value)` n番目に値を追加。
- `pop(n)` n番目の値を取り出す。
- `del` 削除。変数を指定すると変数自体を削除。

``` py
> n = [1, 2, 3, 4]
> n.remove(2)
> n # [1, 3, 4]
> n.remove(2)
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
ValueError: list.remove(x): x not in list
```
- `remove(value)` 値を指定して削除。なければエラー。

```py
> a = [1, 2, 3, 4, 5]
> b = [6, 7, 8, 9, 0]
> a += b # [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]
> x = [1, 2, 3, 4, 5]
> y = [1, 2, 3, 4, 5]
> x.extend(y) # [1, 2, 3, 4, 5, 1, 2, 3, 4, 5]
```
- 配列同士の結合にも演算子が使える。
- `extend()` 結合。

## リストのメソッド
```py
r = [1, 2, 3, 4, 5, 1, 2, 3]
print(r.index(3)) # 2
print(r.index(3, 3)) # 7

print(r.count(3)) # 2

print(5 in r) # True
```
- `index(value, index)` 値が該当するインデックスの値を表示する。第2引数にインデックスをいれるとそれ以降の該当するインデックスを表示する。
- `count(value)` 値が該当する数を表示する
- `value in r` とするとリストの中に値が入っているか確認できる。

```py
r.sort()
print(r) # [1, 1, 2, 2, 3, 3, 4, 5]

r.sort(reverse=True)
print(r) # [5, 4, 3, 3, 2, 2, 1, 1]

r.reverse()
print(r)
```
- `sort` `reverse` 値のソート。

```py
s = 'My name is Mike'
to_split = s.split(' ')
print(to_split) # ['My', 'name', 'is', 'Mike']
x = ' '.join(to_split)
print(x) # My name is Mike

help(list)
```
- `split(str)` 文字列を指定してリストを作成する。
- `str.join(to_split)` リストを文字列に変換する。最初につく文字は区切り文字。
- `help(list)` リストにまつわるヘルプを表示。

## 参照渡し
```py
i = [1, 2, 3, 4, 5]
j = i
j[0] = 100

print('i => ', i) # i =>  [100, 2, 3, 4, 5] 
print('j => ', j) # j =>  [100, 2, 3, 4, 5] # 参照渡しが発生
```
Pythonはリストの定義に参照私が発生するので注意。  
回避するためには、`copy()`を使って複製するようにする。

### IDの確認
`id(var)` でその変数のIDを確認できる。