# データ構造

## ディクショナリー型
```py
> d = {'x' : 10, 'y': 20}
> d['x']  # {'x': 100, 'y': 20}
> type(d)  # <class 'dict'>
```

### 様々な定義方法
```py
> dict([('a', 10)])   # {'a': 10}
> dict([('a', 10), ('b', 20)])  # {'a': 10, 'b': 20}
```

### メソッド
```py
> d = {'x' : 10,'y' : '20'}
> d.keys()  # dict_keys(['x', 'y'])
> d.values()  # dict_values([10, '20'])
> d2 = {'x': 1000, 'z': 500}
> d.update(d2)  # {'x': 1000, 'y': '20', 'z': 500}
> d.get('x')
1000
> d.pop('x')  # {'y': '20', 'z': 500} 値を取り出した
1000

> type(d.get('a')) # getを取り出そうとするとnoneが返る  
<class 'NoneType'>

```
- `updeate` ほかのディクショナリー型を使ってオーバーライドする。

```py
> d.clear()  # {}
```
- `clear` 値を取り消すことができる。


```py
> d = {'a': 100, 'b' : '200'}
> 'a' in d
True
```

### コピー
- リスト型と同様、参照渡しとなる。